Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: དམ་པའི་ཆོས་ཀྱི་ཕྱོགས་སུ་གཏོགས་པའི་སེམས་ཅན་རྣམས་ཡུན་རིང་དུ་གནས་པར་འདོད་པ། མ་འོངས་པའི་སེམས་ཅན་བསོད་ནམས་ཆུང་ངུ་རྣམས་ཀྱི་བསོད་ནམས་ཀྱི་ཕུང་པོ་ཆེན་པོ་རྒྱ་ཆེན་པོ་བསྐྱེད་པ་དང་། དམ་པའི་ཆོས་གནས་པར་འདོད་པ་རྣམས་ཕྱེ་མ་རེད་ཀྱི་དུས་ཀྱི་ཚེ་རང་རང་གི་གནས་ནས་བྱུང་ནསབཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་སྟེ་
en: They wished to permanently establish all sentient beings within the excellent Dharma and to produce a great and vast accumulation of merit for all those future sentient beings with little merit, establishing them as well within the excellent Dharma. After noon, they set forth from their respective abodes and went to where the Bhagavān was staying.

source: ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཆོས་ཀྱི་འདུ་སྟོན་ལ་མཆོད་པ་བྱས་ཏེ། མཚན་མཐའ་ཡས་པས་ཡང་དག་པར་བརྒྱན་པ། སྟོན་ཟླ་ཐ་ཆུང་གི་ཟླ་བ་ཉ་བ་ལྟ་བུའི་རྒྱལ་བ་ཟླ་བའི་ཞབས་ལ་མགོ་བོས་ཡུན་རིང་དུ་ཕྱག་འཚལ་ནས།
en: Having arrived there, they made offerings to the collected Dharma teachings of the Bhagavān and completely adorned him with a limitless array of ornaments. For a great while they prostrated, touching their heads to his glorious feet, which are like the late-autumn moon.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ།
en: They then circumambulated the Bhagavān three times.

source: དེ་ནས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་སྙིང་པོ་ཞེས་བྱ་བ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: At that time, the bodhisattva mahāsattva Great Cloud Essence rose from his seat, draped his robe over one shoulder, touched his right knee to the ground, and bowed toward the Bhagavān with palms joined.

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: He then addressed the Bhagavān, saying,

source: གལ་ཏེ་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན། བཅོམ་ལྡན་འདས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུའོ། །
en: “I would like to ask about a few things, if the Bhagavān could grant the opportunity and give explanations in response to my questions.”

source: དེ་སྐད་ཅེས་གསོལ་ནས། བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: Having been entreated in this fashion, the Bhagavān replied to the bodhisattva mahāsattva Great Cloud Essence,

source: སྤྲིན་ཆེན་སྙིང་པོ་ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་། ངས་དྲིས་པ་དེ་དང་དེའི་ལུང་བསྟན་པས་ཁྱོད་ཀྱི་སེམས་རངས་པར་བྱའོ། །
en: “Great Cloud Essence, you may ask the Tathāgata whatever you wish. Whatever you ask of me, I will put your mind at ease with an authoritative explanation.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་སྙིང་པོས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When this reply had been given, the bodhisattva mahāsattva Great Cloud Essence addressed the Bhagavān, saying,

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་མདོ་གང་དང་ལྡན་ན་ཏིང་ངེ་འཛིན་གྱི་རྒྱ་མཚོར་ཡང་འགྱུར་བ་དང་། ཏིང་ངེ་འཛིན་ཡང་དག་པར་སོགས་པར་ཡང་འགྱུར་བ་དང་།
en: “Bhagavān, which of the various bodhisattva discourses contains the teaching on how to become an ocean of samādhis? How do we correctly develop the samādhis?

source: ཐོས་པའི་རྒྱ་མཚོར་ཡང་འགྱུར་བ་དང་། ཐོས་པ་ཡང་དག་པར་སོགས་པར་ཡང་འགྱུར་བ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་སོམ་ཉི་མི་འཚལ་ཞིང་ཡིད་གཉིས་མ་མཆིས་ལ་ཐེ་ཚོམ་འཚལ་བར་ཡང་མི་འགྱུར་བ་དང་།
en: How do we become an ocean of learning? How do we correctly develop learning? How do we avoid being skeptical, being ambivalent, or entertaining doubts concerning the attainment of unsurpassed, complete awakening?

source: མི་ཁོམ་པ་རྣམས་སུ་སྐྱེ་བར་མི་འགྱུར་བ་དང་།
en: How do we avoid being born within unfree states of existence?

source: ཚེ་རབས་དྲན་པར་ཡང་འགྱུར་བ་དང་།
en: How do we attain the recollection of previous lives?

source: འཁོར་བའི་ལས་ཀྱི་ཞིང་གི་རྒྱ་མཚོ་ལ་སྲེད་པར་ཡང་འགྱུར་བ་དང་།
en: How do we thirst for the expansive ocean of saṃsāric activity?

source: ཚེ་རབས་ཐམས་ཅད་དུ་ཐ་ན་རྨི་ལམ་ན་ཡང་སངས་རྒྱས་མཐོང་བ་དང་འབྲལ་བར་ཡང་མི་འགྱུར་བ་དང་།
en: How can we behold the buddhas and never become separated from this sight during all our lifetimes, even in dreams?

source: དེ་དག་གི་དགེ་བའི་ཆོས་རྣམས་ལ་བར་ཆད་བགྱི་བའི་སླད་དུ་བདུད་སྡིག་ཅན་གླགས་ལྟ་བ་དང་། སྐབས་ཚོལ་བས་གླགས་རྙེད་པར་ཡང་མི་འགྱུར་བ་དང་།
en: How do we prevent evil Māra from finding and taking advantage of opportunities to hinder the virtuous Dharmas of the buddhas?

source: ང་རྒྱལ་ཆོམས་པར་ཡང་འགྱུར་བ་དང་།
en: How do we subdue pride?

source: གཟུངས་ཐོབ་པར་ཡང་འགྱུར་བ་དང་།
en: How do we obtain dhāraṇīs?

source: དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་དག་དཔྱོད་པ་ལ་མཁས་པར་ཡང་འགྱུར་བ་དང་།
en: “How do we become skilled at analyzing the concealed intent of the Tathāgata’s speech?

source: ཆོས་ཐམས་ཅད་ཀྱི་གསང་བའི་སྒོར་འཇུག་པར་ཡང་འགྱུར་བ་དང་།
en: How do we enter the secret gateway of all phenomena?

source: དེ་བཞིན་གཤེགས་པའི་གཏེར་ཡང་དག་པར་སྟོན་པར་ཡང་འགྱུར་བ་དང་།
en: How do we correctly expound the Tathāgata’s treasury?

source: དེ་བཞིན་གཤེགས་པའི་ཚུལ་ལ་འཇུག་པར་ཡང་འགྱུར་བ་དང་།
en: How do we practice in the Tathāgata’s manner?

source: དེ་བཞིན་གཤེགས་པའི་རྒྱ་མཚོའི་ཆུ་སྲིན་དུ་ཡང་འགྱུར་བ་དང་།
en: How do we become a makara in the Tathāgata’s ocean?

source: དེ་བཞིན་གཤེགས་པའི་གཞུང་ལུགས་ཀྱི་ནང་དུ་ཆུད་པར་ཡང་འགྱུར་བ་དང་།
en: How do we enter the Tathāgata’s scriptural tradition?

source: དེ་བཞིན་གཤེགས་པའི་སྒྱུ་འཕྲུལ་གསང་བའི་སྲུངས་མར་ཡང་འགྱུར་བ་དང་།
en: How do we guard the secrets of the Tathāgata’s illusory emanation?

source: དེ་བཞིན་གཤེགས་པའི་གསུང་བརྗོད་པར་ཡང་འགྱུར་བ་དང་།
en: How do we proclaim the Tathāgata’s speech?

source: དེ་བཞིན་གཤེགས་པའི་དམིགས་པ་ལ་རྣལ་འབྱོར་པར་ཡང་འགྱུར་བ་དང་།
en: How do we join with the Tathāgata’s perception?

source: དེ་བཞིན་གཤེགས་པའི་ཉི་མའི་འོད་ཟེར་དུ་ཡང་འགྱུར་བ་དང་།
en: How do we become the light rays of the Tathāgata’s sun?

source: དེ་བཞིན་གཤེགས་པའི་ཟླ་བའི་དཀྱིལ་འཁོར་གྱི་གཟིར་ཡང་འགྱུར་བ་དང་།
en: How do we attain the brilliance of the Tathāgata’s moon?

source: དེ་བཞིན་གཤེགས་པའི་ཏོག་གི་རྩེ་མོའི་མཆོག་ཏུ་ཡང་འགྱུར་བ་དང་།
en: How do we become the highest tip of the Tathāgata’s emblem?

source: དེ་བཞིན་གཤེགས་པའི་མཚམས་འཛིན་པར་ཡང་འགྱུར་བ་དང་།
en: How do we hold the Tathāgata’s borders?

source: དེ་བཞིན་གཤེགས་པའི་ཕྲིན་ལས་ལ་བརྩོན་པར་ཡང་འགྱུར་བ་དང་།
en: “How do we diligently undertake the Tathāgata’s activities?

source: དེ་བཞིན་གཤེགས་པའི་རྩལ་གྱི་ཤུགས་སུ་ཡང་འགྱུར་བ་དང་།
en: How do we become as potent as the Tathāgata?

source: དེ་བཞིན་གཤེགས་པའི་མུ་སྟེགས་ལ་ངེས་པའི་པད་མ་དཀར་པོར་ཡང་འགྱུར་བ་དང་།
en: How do we become the white lotus of the Tathāgata, which brings certainty to non-Buddhists?

source: དེ་བཞིན་གཤེགས་པའི་དགྱེས་པ་ལ་དགའ་བར་ཡང་འགྱུར་བ་དང་།
en: How do we enjoy the Tathāgata’s joy?

source: དེ་བཞིན་གཤེགས་པའི་མཛོད་ཀྱི་དཀོར་བར་ཡང་འགྱུར་བ་དང་།
en: How do we become a treasurer of the Tathāgata’s storehouse?

source: དེ་བཞིན་གཤེགས་པ་ལ་རྟག་པ་ཉིད་དུ་མཐོང་བར་ཡང་འགྱུར་བ་དང་།
en: How do we see the Tathāgata’s permanence?

source: དེ་བཞིན་གཤེགས་པའི་རྟག་པ་དང་། ཐེར་ཟུག་པ་ཉིད་ཤིན་ཏུ་གསལ་བར་མཐོང་ནས་བདག་ཉིད་བསྔགས་པ་བརྗོད་པའི་རྒྱལ་པོར་ཡང་འགྱུར་བ་དང་།
en: How do we see the permanence and eternality of the Tathāgata with extreme clarity and become kings of praising his exalted character?

source: དེ་བཞིན་གཤེགས་པ་ནི་ཐེར་ཟུག་པའི་སྐུ་ཡིན་ནོ་ཞེས་ཐེར་ཟུག་ཏུ་སྨྲ་བར་ཡང་འགྱུར་བ་དང་།
en: How do we proclaim eternality, stating that ‘the Tathāgata’s body is eternal’?

source: དེ་བཞིན་གཤེགས་པའི་ཞི་བའི་རང་བཞིན་ལ་མངོན་པར་དགའ་བའི་ལྟ་བ་ཕུན་སུམ་ཚོགས་པར་ཡང་འགྱུར་བ་དང་།
en: How do we perfect the view of great joy in the Tathāgata’s tranquil nature?

source: དེ་བཞིན་གཤེགས་པ་ནི་རྟག་པ། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བའོ་ཞེས་རྣམ་པ་ཐམས་ཅད་དུ་ལྟ་བའི་རྒྱ་མཚོ་ཐམས་ཅད་དུ་ཡང་འགྱུར་བ་དང་།
en: How do we become an ocean of the view of all the aspects of the Tathāgata, saying that ‘the Tathāgata is permanent, eternal, constant, and tranquil’?

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་ཆོས་ཀྱི་སྐུ་ཡིན་ནོ་ཞེས་དེ་ཁོ་ན་མཐོང་བར་ཡང་འགྱུར་བ་དང་།
en: “How do we see the reality that ‘the Tathāgata’s body is the Dharma body’?

source: དེ་བཞིན་གཤེགས་པའི་རྡོ་རྗེའི་སྐུ་ནི་མི་ཕྱེད་པའི་སྐུ་ཡིན་ནོ་ཞེས་ཡང་དག་པར་མཐོང་བར་ཡང་འགྱུར་བ་དང་།
en: How do we see the truth that ‘the Tathāgata’s vajra body is an immutable body’?

source: དེ་བཞིན་གཤེགས་པའི་སྐུ་ནི་རུས་པ་མ་ཡིན་ཞིང་ཤ་མ་ཡིན་ལ་ཁྲག་མ་ཡིན་ཏེ་རྒྱུས་པ་མ་ཡིན་ནོ་ཞེས་སྟོང་པ་ཉིད་དུ་སྨྲ་བར་ཡང་འགྱུར་བ་དང་།
en: How do we proclaim emptiness, stating that ‘the Tathāgata’s body is not a body of bone, flesh, blood, or muscle’?

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་བསྟན་པ་ནི་འབྲས་བུ་ཡོད་པ་ཡིན་ནོ་ཞེས་འབྲས་བུ་ཡོད་པར་སྨྲ་བར་ཡང་འགྱུར་བ་དང་།
en: How do we proclaim the existence of fruition, stating that ‘in the Tathāgata’s Dharma teachings, fruition exists’?

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་བསྟན་པ་ལ་ནི་འབྲས་བུ་མེད་པར་འགྱུར་བ་མེད་དོ་ཞེས་མེད་པར་སྨྲ་བར་ཡང་འགྱུར་བ་དང་།
en: How do we proclaim nonexistence, stating that ‘in the Tathāgata’s Dharma teachings, the extinction of fruition is nonexistent’?

source: དེ་བཞིན་གཤེགས་པ་ལ་ནི་གཏན་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འགྱུར་བ་མེད་དོ་ཞེས་གསལ་བར་སྨྲ་བར་ཡང་འགྱུར་བ་དང་།
en: How do we clearly proclaim that ‘the Tathāgata never enters into parinirvāṇa’?

source: དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་རབ་ཏུ་བྱུང་བའི་སེམས་ཅན་རྣམས་ལ་ནི་ཚུལ་ཁྲིམས་ཉམས་པ་མེད་དོ་ཞེས་ཚུལ་ཁྲིམས་ཀྱི་བསྔགས་པ་བརྗོད་པར་ཡང་འགྱུར་བ་དང་།
en: How do we praise discipline, saying that ‘all sentient beings who follow the Tathāgata in going forth to renunciation have uncorrupted discipline’?

source: དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ལ་ནི་ནུབ་པར་འགྱུར་བ་མེད་དོ་ཞེས་ནུབ་པར་མི་འགྱུར་བའི་བསྔགས་པ་བརྗོད་པར་ཡང་འགྱུར་བ་དང་།
en: How do we praise nondeclining, saying that ‘the Tathāgata’s Dharma teachings will not decline’?

source: དེ་བཞིན་གཤེགས་པའི་རིགས་དང་། རྒྱུད་དག་ཅིང་ཡོངས་སུ་དག་ལ་དྲི་མ་མེད་པས་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཐབས་ཀྱི་རིགས་ཀྱི་རྒྱུད་ཡིན་ནོ་ཞེས་ལྟ་བ་ཕུན་སུམ་ཚོགས་པར་ཡང་འགྱུར་བ་དང་།
en: How do we perfect the view maintaining that ‘because there are no stains in the Tathāgata’s thoroughly pure family and lineage, bodhisattvas belong to the family lineage of skillful means’?

source: རྟག་ཏུ་འཁོར་བ་ལ་སྡུག་པར་སེམས་པར་ཡང་འགྱུར་བ་དང་། འཁོར་བའི་བསྔགས་པ་བརྗོད་པར་ཡང་འགྱུར་བ་དང་།
en: “How can we think that being forever in cyclic existence is pleasant? How can we praise cyclic existence?

source: འཁོར་བའི་ཆེད་དུ་ཐོས་པའི་རྒྱ་མཚོར་ཡང་འགྱུར་བ་དང་།
en: How do we become an ocean of learning to cycle within existence?

source: དེ་བཞིན་གཤེགས་པའི་རིགས་ལ་དམིགས་པར་འདོད་པར་ཡང་འགྱུར་བ་དང་།
en: How do we desire to perceive the tathāgata family?

source: རྟག་ཏུ་ཉོན་མོངས་པ་ལ་སེམས་པར་ཡང་འགྱུར་བ་དང་།
en: What do we think about being forever afflicted?

source: ཉོན་མོངས་པ་ལ་སྡུག་པར་སེམས་པར་ཡང་འགྱུར་བ་དང་།
en: How can we think being afflicted is pleasant?

source: ཉོན་མོངས་པའི་སྒོ་རྣམ་པ་སྣ་ཚོགས་འཐོབ་པ་ལ་དད་པ་འཐོབ་པར་ཡང་འགྱུར་བ་དང་།
en: How do we attain faith in obtaining the various aspects of the gateways out of the afflictions?

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཕྲིན་ལས་ཀྱི་ཞིང་ལ་སྨོན་ལམ་འདེབས་པའི་སེམས་སུ་ཡང་འགྱུར་བ་དང་།
en: How do we plant in our minds the aspiration toward the field of all the buddhas’ activities?

source: ལས་ཐམས་ཅད་ཀྱི་རྩ་བ་ནི་ཉོན་མོངས་པ་ཡིན་ནོ་ཞེས་རྙེད་པ་ལེགས་པར་རྙེད་པར་ལྟ་བར་ཡང་འགྱུར་བ་དང་།
en: How do we see and properly secure the discovery that ‘the root of all karmic activity is affliction’?

source: སངས་རྒྱས་ཀྱི་རྟག་པ་ཉིད་ལ་ཡང་སོམ་ཉི་མི་འཚལ་ཞིང་ཡིད་གཉིས་མ་མཆིས་ལ་ཐེ་ཙོམ་འཚལ་བར་ཡང་མི་འགྱུར་བ་དང་།
en: How do we refrain from being skeptical, being ambivalent, or entertaining doubts about the Buddha’s permanence?

source: འཁོར་བ་ལ་མངོན་པར་དགའ་བར་ཡང་འགྱུར་བ་དང་།
en: How can we exhibit joy in cyclic existence?

source: འཁོར་བ་ལ་མོས་པར་ཡང་འགྱུར་བ་དང་།
en: How can we turn toward cyclic existence?

source: བདག་སངས་རྒྱས་སུ་འགྱུར་བར་བྱའོ་ཞེས་རྟག་ཏུ་དད་པའི་སེམས་སུ་ཡང་འགྱུར་བ་དང་།
en: “How do we develop a frame of mind imbued with the lasting faith that ‘I will become a buddha’?

source: བདག་གིས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བྱའོ། །
en: How do we become a bodhisattva, a captain, who makes the aspiration and commitment, ‘I will turn the wheel of Dharma.

source: བདག་གིས་སེམས་ཅན་རྣམས་དགྲོལ་བར་བྱའོ། །
en: I will liberate all sentient beings.

source: བདག་གིས་སངས་རྒྱས་ཀྱི་གདུང་མི་འཆད་པར་བྱའོ་ཞེས་དམ་བཅའ་ཞིང་སྨོན་ལམ་འདེབས་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་དེད་དཔོན་དུ་ཡང་འགྱུར་བ་དང་།
en: I will not cut off ties with my buddha heritage’?

source: བདུད་ཀྱི་སྨན་པར་ཡང་འགྱུར་བ་དང་།
en: How do we become a doctor to Māra?

source: འཁོར་བའི་ཉོན་མོངས་པའི་རྒྱ་མཚོའི་སྟོན་པ་པོར་ཡང་འགྱུར་བ་དང་།
en: How do we become a teacher of the ocean of afflictions of cyclic existence?

source: འཁོར་བའི་ཉོན་མོངས་པའི་ཚོང་རྡལ་འཐོབ་པར་ལྟ་བར་ཡང་འགྱུར་བ་དང་།
en: How do we envision reaching the trading town of the afflictions of cyclic existence?

source: འཁོར་བའི་རྒྱ་མཚོ་ཆེན་པོ་འཐོབ་པས་སྐོམ་པར་ཡང་འགྱུར་བ་དང་།
en: How do we quench our thirst by obtaining the great ocean of cyclic existence?

source: འཁོར་བ་ལ་སྲེད་པར་ཡང་འགྱུར་བ་དང་།
en: How can we thirst for cyclic existence?

source: འཁོར་བ་འཐོབ་པ་ལ་རག་ལས་པའི་སེམས་སུ་ཡང་འགྱུར་བ་དང་།
en: How can we develop a frame of mind that is dependent upon obtaining cyclic existence?

source: འཁོར་བ་འཐོབ་པ་མི་གཏོང་བར་ཡང་འགྱུར་བ་དང་།
en: How can we not abandon the attainment of cyclic existence?

source: འཁོར་བའི་ཆུ་ལ་པད་མའི་རྒྱལ་པོ་རྒྱས་པར་ཡང་འགྱུར་བ་དང་།
en: How can we blossom like a kingly lotus flower in the waters of cyclic existence?

source: འཁོར་བའི་ཉོན་མོངས་པའི་རྒྱ་མཚོ་བཞིར་ཡང་འགྱུར་བ་དང་།
en: How do we become the four oceans of cyclic existence?

source: འཁོར་བའི་ཉོན་མོངས་པ་ལ་རྟག་ཏུ་སྨོན་ལམ་འདེབས་པའི་སེམས་སུ་ཡང་འགྱུར་བ་དང་།
en: How can we continuously plant in our minds the aspiration toward the afflictions of cyclic existence?

source: སེམས་ཅན་དམྱལ་བའི་འགྲོ་བ་ལ་དགའ་བར་ཡང་འགྱུར་བ་དང་།
en: “How can we be joyful about going into the hell realms?

source: སེམས་ཅན་དམྱལ་བའི་འགྲོ་བ་ལ་སེམས་ཤིང་རྟག་ཏུ་བསམ་པ་གཏོང་བའི་ངང་ཚུལ་ཅན་དུ་ཡང་འགྱུར་བ་དང་།
en: How can we think of going to the hell realms and conduct ourselves by always directing our thoughts toward going to the hell realms?

source: སེམས་ཅན་དམྱལ་བའི་ཚོང་རྡལ་གྱི་ཚོང་པར་ཡང་འགྱུར་བ་དང་།
en: How do we become a merchant within the trading town of the hell realms?

source: སེམས་ཅན་དམྱལ་བ་འཐོབ་པ་མི་གཏོང་བར་ཡང་འགྱུར་བ་དང་།
en: How can we not abandon the attainment of the hell realms?

source: སེམས་ཅན་དམྱལ་བའི་མེ་ལ་སེམས་རྒྱས་པར་ཡང་འགྱུར་བ་དང་།
en: How do we extensively contemplate the fires of the hell realms?

source: སེམས་ཅན་དམྱལ་བའི་ཉོན་མོངས་པས་སྙོན་རྨོངས་པར་གྱུར་པ་རྣམས་ལ་བདེ་ཞིང་བསིལ་བའི་རླུང་དུ་ཡང་འགྱུར་བ་དང་།
en: How can we become a pleasing and cooling wind for those beings who have become afflicted by the afflictions of the hell realms?

source: སེམས་ཅན་དམྱལ་བའི་མེ་དྲག་པོ་ལ་སྤྲིན་ཆེན་པོ་ལས་ཆར་ཀུན་ཏུ་འབེབས་པར་ཡང་འགྱུར་བ་དང་།
en: How do we become a shower of rainfall from the great cloud that falls upon the fierce fires of the hell realms?

source: སེམས་ཅན་དམྱལ་བའི་ཐོག་ཏོག་ཏུ་ཡང་འགྱུར་བ་དང་།
en: How do we become hail within the hell realms?

source: སེམས་ཅན་དམྱལ་བའི་སྟོན་པ་པོར་ཡང་འགྱུར་བ་དང་།
en: How do we become a teacher of the hell realms?

source: སེམས་ཅན་དམྱལ་བའི་རྒྱ་མཚོའི་མཉན་པ་ཆེན་པོར་ཡང་འགྱུར་བ་དང་།
en: How do we become a great ferryman in the ocean of the hell realms?

source: སེམས་ཅན་དམྱལ་བའི་སྨན་དུ་ཡང་འགྱུར་བ་དང་།
en: How do we become a doctor of the hell realms?

source: སེམས་ཅན་དམྱལ་བའི་ཟས་སུ་ཡང་འགྱུར་བ་དང་།
en: How do we become sustenance in the hell realms?

source: འཁོར་བའི་སྡུག་བསྔལ་དང་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་ཟིན་པའི་མུན་པ་མུན་ནག་བསལ་བའི་ཕྱིར་སྒྲོན་མ་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: “How do we be like a torch that clears away the thick darkness of those who are seized by all the suffering and afflictions of cyclic existence?

source: སྲིད་པའི་འགྲོ་བ་སྣང་བར་བྱ་བའི་ཕྱིར་མར་མེ་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How do we be like an oil lamp that shines light on all beings within existence?

source: སྲིད་པའི་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་མྱུར་དུ་གདུག་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་གོས་པར་མི་འགྱུར་བའི་ཕྱིར་བར་སྣང་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How do we be like open space, which can never be obscured by the various fast-acting and malevolent afflictions of beings within cyclic existence?

source: སེམས་ནམ་མཁའ་དང་མཚུངས་པའི་ཕྱིར་མི་གནས་པར་ཡང་འགྱུར་བ་དང་།
en: How do we not abide anywhere, because the mind is equal to space?

source: དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་རབ་ཏུ་བྱུང་སྟེ་
en: How can we be like the sun, dissolving afflictions as if melting away a snowbank, having followed the Tathāgata in going forth to renunciation and possessing discipline, strength, and gnosis?

source: ཚུལ་ཁྲིམས་དང་། སྟོབས་དང་། ཡེ་ཤེས་དང་ལྡན་པའི་ཕྱིར་ཁ་བའི་ཕུང་པོ་ལྟ་བུའི་ཉོན་མོངས་པ་སེལ་བའི་ཉི་མ་ལྟ་བུར་ཡང་འགྱུར་བ་དང་། ལེགས་པར་སྨྲས་པ་ཡང་དག་པར་བླངས་པའི་ཕྱིར་གཞན་གྱི་དྲིང་མི་འཇོག་པར་འགྱུར་བ་དང་།
en: How do we attain the state in which one does not posit the ways of other schools, because one has correctly adopted the most excellent position?

source: ཡེ་ཤེས་རྒྱ་མཚོ་དང་ལྡན་པའི་ཕྱིར་རྒྱ་མཚོ་དུག་ཅན་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How do we become like the ocean through possessing oceans of gnosis?

source: དཀར་པོའི་ཆོས་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་ཟླ་བ་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How can we be like the moon, thoroughly perfecting all positive qualities?

source: གཏི་མུག་གི་མུན་པ་སེལ་བའི་ཕྱིར་ཉི་མ་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How can we be like the sun, clearing away the darkness of ignorance?

source: ཉོན་མོངས་པས་འཁོར་བ་ལ་མངོན་པར་འཇུག་ཅིང་འགྲོ་བའི་ཚེ་བར་སྣང་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How can we be like open space when entering into and migrating within cyclic existence by engaging in the afflictions?

source: དེ་དང་དེ་མངོན་པར་རྟོགས་པས་པད་མ་ལྟ་བུར་གོས་པ་མེད་པར་ཡང་འགྱུར་བ་དང་།
en: How can we be unsullied like a lotus flower by manifesting the various realizations?

source: ཆོས་ཐམས་ཅད་ལ་ངེས་པར་འབིགས་པའི་ཕྱིར་རྡོ་རྗེ་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How can we be like a vajra that decisively cuts through all phenomena? “How can we be like a vajra that definitively pierces through all phenomena?

source: དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་ཐོས་ན་མི་གཡོ་བའི་ཕྱིར་རི་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How can we be like a mountain, not wavering when hearing of the permanent, eternal, constant greatness of the Tathāgata’s virtuous qualities?

source: དེ་བཞིན་གཤེགས་པའི་རིགས་དང་རྒྱུད་ལ་ཡེ་ཤེས་རྣམ་པར་དག་པའི་ཕྱིར་བཻ་དཱུརྱ་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How can we be like beryl because the gnosis of the family and lineage of the Tathāgata is completely pure?

source: ཉོན་མོངས་པའི་རྙོག་པ་སེལ་བའི་ཕྱིར་རྒྱ་མཚོ་དུག་ཅན་པའི་གསེར་གྱི་ཕ་བོང་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How can we be like a golden boulder within the poisonous ocean, clearing away the turbidity of the afflictions?

source: དེ་བཞིན་གཤེགས་པའི་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་བརྟན་པའི་རང་བཞིན་མཐོང་བའི་ཕྱིར་ཟླ་བ་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How can we be like the moon, seeing the permanent, eternal, constant nature of the Tathāgata?

source: དེ་བཞིན་གཤེགས་པའི་ཆོས་ལས་མི་གཡོ་བའི་ཕྱིར་རི་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How can we be like a mountain, not wavering from the Tathāgata’s Dharma?

source: དེ་བཞིན་གཤེགས་པ་གཏན་དུ་མྱ་ངན་ལས་མི་འདའ་ཞིང་ཆོས་ནུབ་པར་མི་འགྱུར་བ་ཐོས་ན་མི་གཡོ་བའི་ཕྱིར་སྒོའི་ཐེམ་པ་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How can we be like a door frame, not wavering when hearing that the Tathāgata does not pass into parinirvāṇa and that the Dharma will not disappear?

source: ཡང་དག་པ་མཐོང་བའི་ཕྱིར་སེམས་བརྟན་ཞིང་གནས་པར་ཡང་འགྱུར་བ་དང་།
en: “How can we see what is truly so, so that the mind abides steadily?

source: སེམས་མི་ཕྱེད་པའི་ཕྱིར་རྡོ་རྗེ་ལྟ་བུར་ཡང་འགྱུར་བ་དང་།
en: How can we attain the mind that is incorruptible like a vajra?

source: མངོན་སུམ་དུ་ཡོན་ཏན་མང་པོ་འཐོབ་པ་མང་བར་ཡང་འགྱུར་བ་དང་།
en: How can we abundantly obtain a great display of virtuous qualities?

source: ངོ་ཚ་ཤེས་པ་དང་། ཁྲེལ་ཡོད་པ་དང་ལྡན་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become endowed with a sense of shame and modesty?

source: མཛེས་པར་ཡང་འགྱུར་བ་དང་། བལྟ་ན་སྡུག་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become beautiful? How can we become pleasing to behold?

source: བརྐམ་པ་མེད་པར་ཡང་འགྱུར་བ་དང་། ལུས་ཆུང་ངུར་ཡང་མི་འགྱུར་བ་དང་།
en: How can we be without craving? How can we avoid attaining a weak body?

source: ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become endowed with the most excellent complexion?

source: རིགས་མཐོན་པོར་སྐྱེ་བར་ཡང་འགྱུར་བ་དང་།
en: How can we be born within a noble family?

source: རིགས་ཆེན་པོར་སྐྱེ་བར་ཡང་འགྱུར་བ་དང་།
en: How can we be born within a great family?

source: འཁོར་མང་བར་ཡང་འགྱུར་བ་དང་།
en: How can we have a great retinue?

source: འཁོར་མི་ཕྱེད་པར་ཡང་འགྱུར་བ་དང་། བླ་ན་
en: How can we have a retinue that does not decline?

source: མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་མི་ཉམས་ཤིང་ཡོངས་སུ་ཉམས་པར་མི་འགྱུར་བ་དང་།
en: How can we avoid turning back and never turn back from unsurpassed, complete, and perfect awakening?

source: ཁ་ཟས་ལ་བརྐམ་པར་ཡང་མི་འགྱུར་བ་དང་།
en: How can we not have craving for food?

source: ཤའི་ཁ་ཟས་ཀྱང་རྣམ་པར་སྤོང་བར་འགྱུར་བ་དང་།
en: How can we completely abandon foods containing meat?

source: བློ་གྲོས་དང་ལྡན་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become intelligent?

source: སྐྱེ་བོ་ཐམས་ཅད་ཀྱི་ཡིད་དུ་འོང་ཞིང་ཆེར་བཀུར་བར་ཡང་འགྱུར་བ་དང་།
en: How can we delight and be well respected by all beings?

source: དྲན་པ་དང་ལྡན་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become mindful?

source: གཟི་བྱིན་དང་ལྡན་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become charismatic?

source: ཤེས་རབ་དང་ལྡན་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become wise?

source: དགའ་བ་དང་ལྡན་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become joyful?

source: འཇིག་རྟེན་དང་འཐུན་པར་འཇུག་པར་ཡང་འགྱུར་བ་དང་།
en: “How can we act in harmony with the world?

source: འཇིག་རྟེན་ལ་ཕན་པར་འདོད་པར་ཡང་འགྱུར་བ་དང་།
en: How can we desire to benefit the world?

source: འཇིག་རྟེན་ལ་བདེ་བར་ཡང་འགྱུར་བ་དང་།
en: How can we take pleasure in the world?

source: འཇིག་རྟེན་གྱི་ཐུ་བོར་ཡང་འགྱུར་བ་དང་།
en: How can we become prominent within the world?

source: འཇིག་རྟེན་གྱི་གཙོ་བོར་ཡང་འགྱུར་བ་དང་།
en: How can we become a leader within the world?

source: འཇིག་རྟེན་གྱི་མཆོག་ཏུ་ཡང་འགྱུར་བ་དང་།
en: How can we become supreme within the world?

source: འཇིག་རྟེན་གྱི་རབ་ཏུ་ཡང་འགྱུར་བ་དང་།
en: How can we become the utmost within the world?

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱ་བར་འོས་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become worthy of receiving homage from all worlds?

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མཆོད་པའི་གནས་སུ་ཡང་འགྱུར་བ་དང་།
en: How can we become a recipient of offerings from all worlds?

source: སྦྱིན་བདག་ཆེན་པོར་ཡང་འགྱུར་བ་དང་།
en: “How can we become a great donor?

source: སྟོབས་ཆེན་པོ་དང་ལྡན་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become strong?

source: དཔའ་བོ་ཆེན་པོར་ཡང་འགྱུར་བ་དང་།
en: How can we become a great hero?

source: བརྩོན་འགྲུས་ཆེན་པོ་དང་ལྡན་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become perseverant?

source: བྱམས་པའི་སེམས་དང་ལྡན་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become loving and kind?

source: བདེན་པར་སྨྲ་བར་ཡང་འགྱུར་བ་དང་།
en: How can we speak the truth?

source: བརྟུལ་ཞུགས་བརྟན་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become steadfast in our ascetic practice?

source: བརྩོན་འགྲུས་བརྩམས་པར་ཡང་འགྱུར་བ་དང་།
en: How can we exercise perseverance?

source: བྱམས་པ་ལ་གནས་པར་ཡང་འགྱུར་བ་དང་།
en: How can we remain full of loving-kindness?

source: སྙིང་རྗེ་ལ་གནས་པར་ཡང་འགྱུར་བ་དང་།
en: How can we remain compassionate?

source: དགའ་བ་ལ་གནས་པར་ཡང་འགྱུར་བ་དང་།
en: How can we remain joyful?

source: བཏང་སྙོམས་ལ་གནས་པར་ཡང་འགྱུར་བ་དང་།
en: How can we remain equanimous?

source: སྟོང་པའི་ཆོས་རྣམས་ལ་སྟོང་པར་སྨྲ་བར་ཡང་འགྱུར་བ་དང་།
en: How can we profess the emptiness of all empty phenomena?

source: སྟོང་པ་མ་ལགས་པའི་ཆོས་རྣམས་ལ་སྟོང་པ་མ་ལགས་པར་སྨྲ་བར་ཡང་འགྱུར་བ་དང་།
en: How can we profess the nonemptiness of all nonempty phenomena?

source: སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་དོན་རྟོགས་པར་སྨྲ་བར་ཡང་འགྱུར་བ་དང་།
en: How can we profess the meaning and the reasoning behind the Buddha’s teachings?

source: སངས་རྒྱས་ཀྱི་དེ་ཁོ་ནའི་ཆོས་ཀྱི་ལྟ་བ་སྨྲ་བར་ཡང་འགྱུར་བ་དང་།
en: How can we profess the view of the Buddha’s teachings of reality?

source: གཙང་བར་ཡང་འགྱུར་བ་དང་།
en: “How can we become pure?

source: གཙང་མས་ཕྱུག་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become rich with purity?

source: ཡོན་ཏན་གྱིས་ཕྱུག་པར་ཡང་འགྱུར་བ་དང་།
en: How can we become rich with awakened qualities?
